---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbAssignedDistSysToCircuit
source: html/3da20906-2027-58df-e1fd-a62b1d45d9e3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchNmbAssignedDistSysToCircuit Property

Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; }
```